/* ============================================================
   data/tutorial.js —— 新手引导步骤
   ============================================================ */

const TUTORIAL_STEPS = [
  {
    text: '欢迎我自己来到我们的「家是本」餐饮店！',
    subtext: '总之，虽然经历了很多困难，但是我们最后还是把餐饮店办起来了。',
    target: null,
  },
  {
    text: '正式开始之前，让我再来回顾一下店里都有什么吧。',
    subtext: '加油，蕾叶！为了正式开业做好十全的准备！',
    target: null,
  },
  {
    text: '这是我们的餐厅！',
    subtext: '每天都会有客人会进来坐下，点击客人可以和他们互动哦！',
    target: '#scene-restaurant',
  },
  {
    text: '有的时候会有一些不太一样的稀客出现呢……',
    subtext: '和他们对话的话，说不定会有特殊收获！向她们传播家是本文化吧！',
    target: '#scene-restaurant',
  },
  {
    text: '餐馆需要【后厨】【洗碗】【前台】同时有人才能正常营业。',
    subtext: '点击岗位台可以快速安排家庭成员来排班。',
    target: '#scene-restaurant',
  },
  {
    text: '家人的精力当然不是无限的啦……',
    subtext: '工作会消耗精力，精力太低了家人就会累倒的……不过不用担心，她们只要休息好了就会康复的！',
    target: '#scene-restaurant',
  },
  {
    text: '左下角是我们餐厅的特色！音响！。',
    subtext: '点它可以切换播放的音乐，不同音乐对客人的吸引力也不一样哦！',
    target: '.music-speaker',
  },
  {
    text: '顶部这里是目前的状态栏。',
    subtext: '显示周数、现金、贷款和进度。当然，我们还要还清“创业扶持基金”，点"贷款"这里就可以呼出还款菜单啦。',
    target: '#status-bar',
  },
  {
    text: '底部这里是功能菜单。',
    subtext: '【家庭】是我安排家庭成员的工作和检查她们状态的地方 ·【菜单】能决定今天上什么菜 ·【商店街】可以安排“休息”状态的家庭成员去打工并获取报酬和新菜谱 ·【账本】就是我们的家庭收支记录！',
    target: '#tab-bar',
  },
  {
    text: '在完成了所有家庭成员的排班和菜单的准备之后，点「营业结算」开始本周的营业状态结算。',
    subtext: '一个回合就是一周，会结算收入、支出和特殊事件，然后进入下一个回合！这是推动前进的唯一方式！',
    target: '.home-bottom-bar',
  },
  {
    text: '总之还有一些别的小机制，需要我来慢慢探索啦……因为我也是刚起步呢……',
    subtext: '那么——开始吧！还清所有贷款，赚到100w现金！加油吧，my family！',
    target: null,
  },
];